%%%%%%%%%%%%%%%%%%%%%%%%%%%% Входной файл %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Абсолютная температура
T = 300;

% Размеры RTD, нм
d = 2;                    % Барьер
Ld = 5;                   % Удлинение
L = d + Ld;               % Общая длина

% Дно зоны проводимости, eV
E_0 = 1.4;

% Смещение дна зоны проводимости, eV
U0 = 0.2; 

% Начало первого барьера, and limits of space domain
xb = 0;

% Относительная эффективная масса
mw = 0.067;
md = 0.083;

%%%%%%%%%%%%%%%%%%% Перевод в атомные единицы Хартри %%%%%%%%%%%%%%%%%%%%%%

m_e = 1;
hbar = 1;
q = 1;

q_SI = 1.602176634e-19;
a0_SI = 5.291772109e-11; 
m0_SI = 9.1093837e-31;
nm_a0_sf = 1e-9 / a0_SI ;
Eh_SI = 4.35974472220712e-18;
Eh_eV = Eh_SI / q_SI;
V_Hartree_SI = 27.2113862456;
hbar_SI = 1.054571817e-34;

d = d * nm_a0_sf;

%%%%%%%%%%%%%%%%%%%%%%%%%% Расчеты энергии %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

E_0 = E_0 / Eh_eV;
U0 = U0 / Eh_eV; 

%%%%%%%%%%%%%%%%%%%%%%%%% Масштабирование области %%%%%%%%%%%%%%%%%%%%%%%%%

L = L * nm_a0_sf;